DDES/constant/momentumProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
    LESModel            SpalartAllmarasDDES; //SpalartAllmarasDDES

    delta               cubeRootVol;

    printCoeffs         on;

    turbulence          on;

  //  cubeRootVolCoeffs
  //  {
  //      deltaCoeff      1;
 //   }

   
}

// ************************************************************************* //
