DDES/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
 p
    {
        solver          GAMG;
        tolerance       1e-4;
        relTol          0.1;
        smoother        GaussSeidel;
minIter 2;
     }

    pFinal
    {
        $p;
         relTol          0;
    }

     "(U|k|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
        minIter 1;

    }

"(U|k|nuTilda)Final"
    {
        $U;
        tolerance       1e-07;
        relTol          0;
    }


}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 2;
  }


relaxationFactors
   {
   fields
      {
      p 0.3;
      pFinal 0.7; // Last outer loop
      }

   equations
      {
      U 0.6;
      UFinal 0.8; // Last outer loop
      k 0.6;
      kFinal 0.7; // Last outer loop
      nuTilda 0.6;
      nuTildaFinal 0.7; // Last outer loop

      }


   }// ************************************************************************* //
